Repository: ispras/qdt
Catalog: locale/*/LC_MESSAGES/qdc.po
Languages: ru_ru

source: Coroutine based task without description
ru_ru: Задача-сопрограмма без описания

source: Signal Dispatcher
ru_ru: Диспетчер сигналов

source: Reversible operation with unimplemented description (class %s).
ru_ru: Обратимая операция без описания (класс %s).

source: The beginning of known history.
ru_ru: Начало известной истории.

source: Edit history test
ru_ru: Тест истории редактирования

source: Undo
ru_ru: Отменить

source: Redo
ru_ru: Повторить

source: Edit
ru_ru: Правка

source: Mnemonic
ru_ru: Мнемоника

source: Occurrences
ru_ru: Вхождения

source: Variants met
ru_ru: Встречено вариантов

source: Variants total
ru_ru: Всего вариантов

source: Mode
ru_ru: Режим

source: FI arg1
ru_ru: FI 1 аргумент

source: FI arg2
ru_ru: FI 2 аргумент

source: FII arg
ru_ru: FII аргумент

source: FIII arg
ru_ru: FIII аргумент

source: YES
ru_ru: ДА

source: NO
ru_ru: НЕТ

source: Apply
ru_ru: Применить

source: Save
ru_ru: Сохранить

source: Load
ru_ru: Загрузить

source: Background tasks:
ru_ru: Фоновые задачи:

source: Generation
ru_ru: Генерация

source: Generation completed
ru_ru: Генерация завершена

source: No errors were reported.
ru_ru: Сообщений об ошибках не было.

source: Qemu device creator GUI
ru_ru: ГИ генератора устройств Qemu

source: If editing history window is hidden then show it else hide it.
ru_ru: Если окно истории редактирования скрыто, то показать его, а иначе - скрыть.

source: Load project from file.
ru_ru: Загрузить проект из файла.

source: Create new project.
ru_ru: Создать новый проект.

source: Add description to the project
ru_ru: Добавить описание в проект

source: Set Qemu build path for the project
ru_ru: Задать путь сборки QEMU для проекта

source: Launch code generation
ru_ru: Запустить генерацию кода

source: Shutdown the application.
ru_ru: Завершить приложение.

source: Revert previous editing.
ru_ru: Отменить изменения.

source: Make reverted editing again.
ru_ru: Повторить отменённые изменения.

source: Save project.
ru_ru: Сохранить проект.

source: Add description
ru_ru: Добавить описание

source: Set Qemu build path
ru_ru: Задать путь сборки QEMU

source: Generate
ru_ru: Сгенерировать

source: New project
ru_ru: Новый проект

source: Save project as...
ru_ru: Сохранить проект как...

source: Quit
ru_ru: Выход

source: File
ru_ru: Файл

source: Rebuild Cache
ru_ru: Перестроить кэш

source: Editing history window
ru_ru: Окно истории редактирования

source: Cache rebuilding is impossible
ru_ru: Перестроение кэша невозможно

source: Selected Qemu build path is bad. Reason: %s
ru_ru: Выбран плохой путь сборки QEMU. Подробности: %s

source: Cache rebuilding
ru_ru: Перестроение кэша

source: Cache building is already in process. Do you want to start cache rebuilding?
ru_ru: Построение кэша уже выполняется. Вы точно хотите начать перестроение кэша?

source: Current project has unsaved changes. Would you like to save it? Note that a backup is always saved with name project.py in current working directory.
ru_ru: Данный проект имеет не сохранённые изменения. Хотите ли Вы сохранить проект? Замечание: резервная копия проекта в любом случае будет сохранена в текущей папке под именем project.py.

source: Select Qemu build path
ru_ru: Выбрать путь сборки QEMU

source: Generation is cancelled
ru_ru: Генерация отменена

source: At least one generation task is already in process.
ru_ru: Как минимум одна генерация уже выполняется.

source: Generation is impossible
ru_ru: Генерация невозможна

source: No Qemu build path is set for the project.
ru_ru: Для проекта не задан путь сборки QEMU.

source: Qemu version cache is not ready yet. Try later.
ru_ru: Кэш версии QEMU ещё не готов. Попробуйте позже.

source: Cannot save project
ru_ru: Невозможно сохранить проект

source: QDC GUI Project defining script
ru_ru: скрипт-проект для ГИП QDT

source: Save project
ru_ru: Сохранить проект

source: Current project has unsaved changes. They will be lost. Continue?
ru_ru: В текущем проекте есть не сохранённые изменения. Они будут потеряны. Продолжить?

source: Load project
ru_ru: Загрузить проект

source: Project loading failed
ru_ru: Не удалось загрузить проект

source: No QEMU build path selected
ru_ru: Путь сборки QEMU не выбран

source: device '%s'
ru_ru: устройство '%s'

source: bus '%s'
ru_ru: шина '%s'

source: memory region '%s'
ru_ru: участок памяти '%s'

source: IRQ line
ru_ru: линия IRQ

source: IRQ hub
ru_ru: концентратор IRQ

source: node
ru_ru: узел

source: Include memory region %s (%d) to %s (%d).
ru_ru: Вложить участок памяти %s (%d) в %s (%d).

source: Exclude memory region %s (%d) from %s (%d).
ru_ru: Исключить участок памяти %s (%d) из %s (%d).

source: container
ru_ru: контейнер

source: alias of %s (%d) with offset %s
ru_ru: перенаправление на %s (%d) со смещением %s

source: system address space
ru_ru: системное адресное пространство

source: Create memory region %s (%d) of kind %s.
ru_ru: Создать участок памяти %s (%d), вид: %s.

source: Delete memory region %s (%d) of kind %s.
ru_ru: Удалить участок памяти %s (%d), вид: %s.

source: PCI(E) function
ru_ru: функция PCI(E)

source: generic device
ru_ru: обобщённое устройство

source: Create %s (%d) of type '%s'.
ru_ru: Создать %s (%d) типа '%s'.

source: Delete %s (%d) of type '%s'.
ru_ru: Удалить %s (%d) of type '%s'.

source: system bus
ru_ru: системная шина

source: PCI(E) bus
ru_ru: шина PCI(E)

source: ISA bus
ru_ru: шина ISA

source: IDE bus
ru_ru: шина IDE

source: I2C bus
ru_ru: шина I2C

source: Create %s (%d).
ru_ru: Создать %s (%d).

source: Delete %s (%d).
ru_ru: Удалить %s (%d).

source: Make device %s (%d) a controller of bus %s (%d) with index %d.
ru_ru: Сделать устройство %s (%d) контроллером шины %s (%d) с индексом %d.

source: Disconnect bus %s (%d) from index %d of controller %s (%d).
ru_ru: Отсоединить шину %s (%d) с индексом %d от контроллера %s (%d).

source: Replace bus %s (%d) with %s (%d) in controller %s (%d) at index %d.
ru_ru: Заменить шину %s (%d) на %s (%d) в контроллере %s (%d) по индексу %d.

source: IRQ hub (%d)
ru_ru: концентратор IRQ (%d)

source: Delete IRQ line (%d) from %s to %s.
ru_ru: Удалить линию IRQ (%d) от %s к %s.

source: Create IRQ line (%d) from %s to %s.
ru_ru: Создать линию IRQ (%d) от %s к %s.

source: Create IRQ hub (%d).
ru_ru: Создать концентратор IRQ (%d).

source: Delete IRQ hub (%d).
ru_ru: Удалить концентратор IRQ (%d).

source: Directory
ru_ru: Папка

source: Size
ru_ru: Размер

source: All events
ru_ru: Все

source: None events
ru_ru: Ни одного

source: Invert selection
ru_ru: Инвертировать

source: Total Instructions
ru_ru: Всего инструкций

source: Time [seconds]
ru_ru: Время [секунды]

source: Add
ru_ru: Добавить

source: Parent device
ru_ru: Устройство-родитель

source: Always show index
ru_ru: Всегда показывать индекс

source: Bus %d configuration.
ru_ru: Настройка шины %d.

source: Bus settings
ru_ru: Установки шины

source: QOM type
ru_ru: Тип QOM

source: Delete
ru_ru: Удалить

source: Select
ru_ru: Выбрать

source: Parent bus
ru_ru: Родительская шина

source: Child buses
ru_ru: Дочерние шины

source: Properties
ru_ru: Свойства

source: Device settings
ru_ru: Установки устройства

source: Device Tree
ru_ru: Дерево устройств

source: Select QOM type
ru_ru: Выбор типа QOM

source: Devices
ru_ru: Устройства

source: Macros
ru_ru: Макросы

source: Unassigned
ru_ru: Не назначено

source: Source
ru_ru: Передатчик

source: Destination
ru_ru: Приёмник

source: Node
ru_ru: Узел

source: GPIO index
ru_ru: Индекс GPIO

source: GPIO name
ru_ru: Имя GPIO

source: IRQ line settings
ru_ru: Установки линии IRQ

source: OK
ru_ru: ОК

source: IRQ source
ru_ru: Передатчик IRQ

source: IRQ destination
ru_ru: Приёмник IRQ

source: Settings
ru_ru: Установки

source: Add IRQ hub
ru_ru: Добавить узел IRQ

source: Dynamic layout
ru_ru: Динамическое размещение

source: Show mesh
ru_ru: Показать сетку

source: Delete point
ru_ru: Удалить точку

source: Export error
ru_ru: Ошибка экспорта

source: Unexpected file extension %s
ru_ru: Неожиданное расширение файла %s

source: Add IRQ line.
ru_ru: Добавить линию IRQ.

source: IRQ hub creation.
ru_ru: Cоздание концентратора IRQ.

source: Use tabs
ru_ru: Вкладки

source: Mesh step:
ru_ru: Шаг сетки

source: Region type
ru_ru: Тип участка

source: Parent region
ru_ru: Участок-родитель

source: Offset
ru_ru: Смещение

source: May overlap
ru_ru: Может перекрываться

source: Priority
ru_ru: Приоритет

source: Memory settings
ru_ru: Настройки памяти

source: Type
ru_ru: Тип

source: Add node
ru_ru: Добавить узел

source: Deletion of selected memory nodes
ru_ru: Удаление выбранных узлов памяти

source: LOOP
ru_ru: ЦИКЛ

source: Slot (Device number)
ru_ru: Слот (номер устройства)

source: Function number
ru_ru: Номер функции

source: multifunction
ru_ru: многофункциональное

source: PCI device configuration.
ru_ru: Настройка PCI-устройства.

source: PCI class code
ru_ru: код PCI-класса

source: Vendor ID
ru_ru: ID производителя

source: Device ID
ru_ru: ID устройства

source: Not specified
ru_ru: Не указано

source: Delete description
ru_ru: Удалить описание

source: Selected descriptions deletion
ru_ru: Удаление выбранных описаний

source: Bad build path
ru_ru: Плохой путь сборки

source: Refresh
ru_ru: Освежить

source: QOM object configuration.
ru_ru: настройка объекта QOM.

source: Variable name base
ru_ru: Основа имени переменной

source: Name of variable
ru_ru: Имя переменной

source: MMIO Mappings
ru_ru: Отображения MMIO

source: PMIO Mappings
ru_ru: Отображения PMIO
